{
  "ir_version": "0.4",
  "validated_by": "ocaml-compiler-v0.4",
  "model": {
    "name": "sir_two_patch",
    "version": "0.3",
    "time_unit": "days",
    "description": null,
    "compartments": [
      { "name": "S_urban", "kind": "integer" },
      { "name": "S_rural", "kind": "integer" },
      { "name": "I_urban", "kind": "integer" },
      { "name": "I_rural", "kind": "integer" },
      { "name": "R_urban", "kind": "integer" },
      { "name": "R_rural", "kind": "integer" }
    ],
    "transitions": [
      {
        "name": "infection_urban",
        "stoichiometry": [ [ "S_urban", -1 ], [ "I_urban", 1 ] ],
        "rate": {
          "bin_op": {
            "op": "div",
            "left": {
              "bin_op": {
                "op": "mul",
                "left": {
                  "bin_op": {
                    "op": "mul",
                    "left": {
                      "bin_op": {
                        "op": "mul",
                        "left": { "param": "R0_urban" },
                        "right": { "param": "gamma" }
                      }
                    },
                    "right": { "pop": "S_urban" }
                  }
                },
                "right": { "pop": "I_urban" }
              }
            },
            "right": { "param": "N_urban" }
          }
        },
        "metadata": {
          "origin_kind": "transmission",
          "source_compartment": "S_urban",
          "dest_compartment": "I_urban"
        },
        "rate_grad": {
          "gamma": {
            "bin_op": {
              "op": "div",
              "left": {
                "bin_op": {
                  "op": "mul",
                  "left": {
                    "bin_op": {
                      "op": "mul",
                      "left": {
                        "bin_op": {
                          "op": "mul",
                          "left": { "param": "R0_urban" },
                          "right": { "pop": "S_urban" }
                        }
                      },
                      "right": { "pop": "I_urban" }
                    }
                  },
                  "right": { "param": "N_urban" }
                }
              },
              "right": {
                "bin_op": {
                  "op": "mul",
                  "left": { "param": "N_urban" },
                  "right": { "param": "N_urban" }
                }
              }
            }
          },
          "N_urban": {
            "bin_op": {
              "op": "div",
              "left": {
                "un_op": {
                  "op": "neg",
                  "arg": {
                    "bin_op": {
                      "op": "mul",
                      "left": {
                        "bin_op": {
                          "op": "mul",
                          "left": {
                            "bin_op": {
                              "op": "mul",
                              "left": { "param": "R0_urban" },
                              "right": { "param": "gamma" }
                            }
                          },
                          "right": { "pop": "S_urban" }
                        }
                      },
                      "right": { "pop": "I_urban" }
                    }
                  }
                }
              },
              "right": {
                "bin_op": {
                  "op": "mul",
                  "left": { "param": "N_urban" },
                  "right": { "param": "N_urban" }
                }
              }
            }
          },
          "R0_urban": {
            "bin_op": {
              "op": "div",
              "left": {
                "bin_op": {
                  "op": "mul",
                  "left": {
                    "bin_op": {
                      "op": "mul",
                      "left": {
                        "bin_op": {
                          "op": "mul",
                          "left": { "param": "gamma" },
                          "right": { "pop": "S_urban" }
                        }
                      },
                      "right": { "pop": "I_urban" }
                    }
                  },
                  "right": { "param": "N_urban" }
                }
              },
              "right": {
                "bin_op": {
                  "op": "mul",
                  "left": { "param": "N_urban" },
                  "right": { "param": "N_urban" }
                }
              }
            }
          }
        }
      },
      {
        "name": "infection_rural",
        "stoichiometry": [ [ "S_rural", -1 ], [ "I_rural", 1 ] ],
        "rate": {
          "bin_op": {
            "op": "div",
            "left": {
              "bin_op": {
                "op": "mul",
                "left": {
                  "bin_op": {
                    "op": "mul",
                    "left": {
                      "bin_op": {
                        "op": "mul",
                        "left": { "param": "R0_rural" },
                        "right": { "param": "gamma" }
                      }
                    },
                    "right": { "pop": "S_rural" }
                  }
                },
                "right": { "pop": "I_rural" }
              }
            },
            "right": { "param": "N_rural" }
          }
        },
        "metadata": {
          "origin_kind": "transmission",
          "source_compartment": "S_rural",
          "dest_compartment": "I_rural"
        },
        "rate_grad": {
          "gamma": {
            "bin_op": {
              "op": "div",
              "left": {
                "bin_op": {
                  "op": "mul",
                  "left": {
                    "bin_op": {
                      "op": "mul",
                      "left": {
                        "bin_op": {
                          "op": "mul",
                          "left": { "param": "R0_rural" },
                          "right": { "pop": "S_rural" }
                        }
                      },
                      "right": { "pop": "I_rural" }
                    }
                  },
                  "right": { "param": "N_rural" }
                }
              },
              "right": {
                "bin_op": {
                  "op": "mul",
                  "left": { "param": "N_rural" },
                  "right": { "param": "N_rural" }
                }
              }
            }
          },
          "N_rural": {
            "bin_op": {
              "op": "div",
              "left": {
                "un_op": {
                  "op": "neg",
                  "arg": {
                    "bin_op": {
                      "op": "mul",
                      "left": {
                        "bin_op": {
                          "op": "mul",
                          "left": {
                            "bin_op": {
                              "op": "mul",
                              "left": { "param": "R0_rural" },
                              "right": { "param": "gamma" }
                            }
                          },
                          "right": { "pop": "S_rural" }
                        }
                      },
                      "right": { "pop": "I_rural" }
                    }
                  }
                }
              },
              "right": {
                "bin_op": {
                  "op": "mul",
                  "left": { "param": "N_rural" },
                  "right": { "param": "N_rural" }
                }
              }
            }
          },
          "R0_rural": {
            "bin_op": {
              "op": "div",
              "left": {
                "bin_op": {
                  "op": "mul",
                  "left": {
                    "bin_op": {
                      "op": "mul",
                      "left": {
                        "bin_op": {
                          "op": "mul",
                          "left": { "param": "gamma" },
                          "right": { "pop": "S_rural" }
                        }
                      },
                      "right": { "pop": "I_rural" }
                    }
                  },
                  "right": { "param": "N_rural" }
                }
              },
              "right": {
                "bin_op": {
                  "op": "mul",
                  "left": { "param": "N_rural" },
                  "right": { "param": "N_rural" }
                }
              }
            }
          }
        }
      },
      {
        "name": "recovery_urban",
        "stoichiometry": [ [ "I_urban", -1 ], [ "R_urban", 1 ] ],
        "rate": {
          "bin_op": {
            "op": "mul",
            "left": { "param": "gamma" },
            "right": { "pop": "I_urban" }
          }
        },
        "metadata": {
          "origin_kind": "intrinsic",
          "source_compartment": "I_urban",
          "dest_compartment": "R_urban"
        },
        "rate_grad": { "gamma": { "pop": "I_urban" } }
      },
      {
        "name": "recovery_rural",
        "stoichiometry": [ [ "I_rural", -1 ], [ "R_rural", 1 ] ],
        "rate": {
          "bin_op": {
            "op": "mul",
            "left": { "param": "gamma" },
            "right": { "pop": "I_rural" }
          }
        },
        "metadata": {
          "origin_kind": "intrinsic",
          "source_compartment": "I_rural",
          "dest_compartment": "R_rural"
        },
        "rate_grad": { "gamma": { "pop": "I_rural" } }
      }
    ],
    "ode_equations": [],
    "time_functions": [],
    "tables": [],
    "interventions": [],
    "observations": [],
    "parameters": [
      {
        "name": "gamma",
        "value": null,
        "bounds": [ 0.01, 1.0 ],
        "prior": null,
        "hierarchical": null,
        "transform": null,
        "initial_value": null,
        "param_kind": "positive",
        "param_dim": null
      },
      {
        "name": "N_urban",
        "value": null,
        "bounds": [ 100.0, 100000.0 ],
        "prior": null,
        "hierarchical": null,
        "transform": null,
        "initial_value": null,
        "param_kind": "positive",
        "param_dim": null
      },
      {
        "name": "N_rural",
        "value": null,
        "bounds": [ 100.0, 100000.0 ],
        "prior": null,
        "hierarchical": null,
        "transform": null,
        "initial_value": null,
        "param_kind": "positive",
        "param_dim": null
      },
      {
        "name": "R0_urban",
        "value": null,
        "bounds": [ 0.5, 10.0 ],
        "prior": null,
        "hierarchical": null,
        "transform": null,
        "initial_value": null,
        "param_kind": "positive",
        "param_dim": null
      },
      {
        "name": "R0_rural",
        "value": null,
        "bounds": [ 0.5, 10.0 ],
        "prior": null,
        "hierarchical": null,
        "transform": null,
        "initial_value": null,
        "param_kind": "positive",
        "param_dim": null
      }
    ],
    "initial_conditions": {
      "explicit": {
        "S_urban": 990.0,
        "I_urban": 10.0,
        "R_urban": 0.0,
        "S_rural": 999.0,
        "I_rural": 1.0,
        "R_rural": 0.0
      }
    },
    "output": {
      "times": { "regular": { "start": 0.0, "step": 1.0, "end": 200.0 } },
      "format": "tsv",
      "trajectory": true,
      "observations": true
    },
    "simulation": {
      "t_start": 0.0,
      "t_end": 200.0,
      "time_semantics": "continuous",
      "dt": null,
      "rng_seed": null
    },
    "scenarios": [
      {
        "name": "baseline",
        "label": "default",
        "params": {
          "gamma": 0.1,
          "N_urban": 1000.0,
          "N_rural": 1000.0,
          "R0_urban": 2.5,
          "R0_rural": 1.8
        },
        "enable": [],
        "disable": [],
        "t_end": null
      }
    ],
    "model_structure": {
      "dimensions": [ { "name": "patch", "values": [ "urban", "rural" ] } ],
      "compartment_dims": {
        "S": [ "patch" ],
        "I": [ "patch" ],
        "R": [ "patch" ]
      },
      "base_compartments": [ "S", "I", "R" ],
      "transmission_transitions": [ "infection" ],
      "infectious_compartments": [ "I" ]
    }
  }
}
